{"meta":{"title":"Hello Okay Bye!","subtitle":"No pain No gain","description":"","author":"Jaeyong Yoo","url":"https://yoo0926.github.io","root":"/"},"pages":[],"posts":[{"title":"about","slug":"about","date":"2020-11-01T06:46:12.000Z","updated":"2020-11-01T06:46:12.112Z","comments":true,"path":"2020/11/01/about/","link":"","permalink":"https://yoo0926.github.io/2020/11/01/about/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"","slug":"start-blog-hexo","date":"2020-11-01T06:34:25.000Z","updated":"2020-11-01T09:04:00.249Z","comments":true,"path":"2020/11/01/start-blog-hexo/","link":"","permalink":"https://yoo0926.github.io/2020/11/01/start-blog-hexo/","excerpt":"","text":"블로그를 시작하며그동안 OneNote, Notion 등 노트프로그램을 사용하여 단편적으로 공부하던 내용을 블로그를 통해 좀 더 체계적으로 정리하고 다른사람들과 공유하고 싶은 생각에 블로그를 시작하기로 했다.(끈기가 부족한 편이라 얼마나 갈진 모르겠다^^;;) 일반적인 블로그를 생각하면 네이버 블로그, 티스토리, 혹은 미디엄, 브런치 등을 떠올릴 수 있지만 기술블로그를 표방하는만큼 github page를 이용하기로 마음먹었다. github page에서는 username.github.io 도메인을 무료로 제공하여 정적 웹페이지를 무료 호스팅해주고 있다. github page에서 사용할 정적 웹페이지 생성기는 생각보다 다양한 종류가 있지만 마크다운 문서를 지원하면서 국내에서 가장 많이 사용되는 두가지는 다음과 같다. Jekyll Ruby 기반 다양한 테마, 플러그인 지원 환경설정 및 커스터마이징이 다소 복잡하며(특히 윈도우에서) 글이 많아지면 빌드속도가 느려진다는 이야기가 있다. Hexo Javascript(Node.js) 기반 마찬가지로 다양한 테마, 플러그인 지원 npm을 통해 쉽게 설치 가능하며 Github 배포과정도 편하다. 처음엔 Jekyll을 사용하여 초기설정을 해봤는데 윈도우에서 설정이 너무 복잡하고 오류도 많이나서 익숙한 Node.js기반의 Hexo로 시작하기로 했다. 1. 설치1.1 사전준비 Node.js 설치 Git 설치 Github 가입 후 신규 Repository 2개 생성 각 프로그램 설치는 이미 많은 문서들이 있기 때문에 별도로 언급하진 않겠다. Repository를 2개 생성하는 이유는 각각 블로그 운영, hexo 설정을 저장할 목적이며 블로그로 운영할 Repository name은 USERNAME.github.io 의 Public으로 생성한다. 2. Hexo 설치 및 블로그 생성Hexo설정을 저장할 github repository를 clone 한 후 해당 위치에서 작업한다. 1234npm install -g hexo-clihexo init $디렉토리명cd $디렉토리명npm install 2.1 설정파일 수정블로그 생성이 정상적으로 완료되었으면 이제 설정파일을 수정해보자. root 경로에 _config.yml파일을 확인할 수 있는데 기본적인 블로그 설정은 이곳에서 관리한다. 자세한 내용은 공식문서에서 확인할 수 있다. Hexo Docs : https://hexo.io/docs/ Site 설정블로그 이름 및 간략한 소개를 설정한다. 12345title: Hello Worldsubtitle: No pain, No gaindescription:author: Jaeyong Yoo... URL 설정블로그 URL 정보를 설정한다. 1234url: https:&#x2F;&#x2F;USERNAME.github.ioroot: &#x2F;permalink: :year&#x2F;:month&#x2F;:day&#x2F;:title&#x2F;permalink_defaults: Github 설정배포할 Github Page의 Repository 정보를 입력한다. 123deploy: type: git repo: https:&#x2F;&#x2F;github.com&#x2F;yoo0926&#x2F;yoo0926.github.io 정상적으로 설치와 설정이 끝났다면 아래 명령어로 서버를 실행시켜 웹브라우저에서 http://localhost:4000 으로 접속하여 확인할 수 있다. 1hexo server #or hexo s 만약 로컬에서 실행 시 permission denied 가 발생하는 경우가 있다면 그냥 port를 변경해서 테스트하자 1hexo server -p 8088 3. Github에 배포하기로컬에서 테스트가 완료되었다면 이제 앞서 언급한 Github Page의 정적 웹페이즈 호스팅을 사용해보자. Hexo Generate and Deploygithub에 배포하기 위해선 hexo-deployer-git 이라는 플러그인을 설치해야 한다. 1npm install hexo-deployer-git 플러그인 설치가 완료되면 배포할 리소스를 생성하여 앞서 _config.yml 파일에서 설정한 배포설정의 저장소로 배포하게 된다. 1234hexo generate #hexo ghexo deploy #hexo d#동시에 하고 싶으면hexo deploy --generate #hexo d -g 생성된 리소스는 USERNAME.github.io 저장소에 배포되며 https://USERNAME.github.io로 접속하게되면 블로그를 확인할 수 있다.","categories":[{"name":"blog","slug":"blog","permalink":"https://yoo0926.github.io/categories/blog/"}],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2020-10-31T09:19:20.663Z","updated":"2020-10-31T09:19:20.663Z","comments":true,"path":"2020/10/31/hello-world/","link":"","permalink":"https://yoo0926.github.io/2020/10/31/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"blog","slug":"blog","permalink":"https://yoo0926.github.io/categories/blog/"}],"tags":[]}